🚀&nbsp; env0 had composed a PR Plan for environment [My First Project / tf-self-qa (tf_self_qa)](http://pr8900.dev.env0.com/p/b91f3296-d249-4938-96a6-72e3d8fe5b3a/environments/7d2d8690-24f0-4a42-af14-d201c687d9d1):
```
Plan: 3 to add, 0 to change, 3 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:


  # aws_s3_bucket.website_bucket must be replaced
-/+ resource "aws_s3_bucket" "website_bucket" {
+       acceleration_status         = (known after apply)
!       arn                         = "arn:aws:s3:::hello-env0-wzodxfuhsxrdfamz" -> (known after apply)
!       bucket                      = "hello-env0-wzodxfuhsxrdfamz" -> "hello-env0-wzodxfuhsxrdfamz-sagi" # forces replacement
!       bucket_domain_name          = "hello-env0-wzodxfuhsxrdfamz.s3.amazonaws.com" -> (known after apply)
!       bucket_regional_domain_name = "hello-env0-wzodxfuhsxrdfamz.s3.amazonaws.com" -> (known after apply)
!       hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
!       id                          = "hello-env0-wzodxfuhsxrdfamz" -> (known after apply)
!       region                      = "us-east-1" -> (known after apply)
!       request_payer               = "BucketOwner" -> (known after apply)
-       tags                        = {} -> null
!       website_domain              = "s3-website-us-east-1.amazonaws.com" -> (known after apply)
!       website_endpoint            = "hello-env0-wzodxfuhsxrdfamz.s3-website-us-east-1.amazonaws.com" -> (known after apply)
        # (2 unchanged attributes hidden)

!       versioning {
!           enabled    = false -> (known after apply)
!           mfa_delete = false -> (known after apply)
        }

!       website {
            # (2 unchanged attributes hidden)
        }
    }


  # aws_s3_bucket_object.object must be replaced
-/+ resource "aws_s3_bucket_object" "object" {
!       bucket                 = "hello-env0-wzodxfuhsxrdfamz" -> "hello-env0-wzodxfuhsxrdfamz-sagi" # forces replacement
!       etag                   = "7497ae336f55298f7959affa7da14197" -> (known after apply)
!       id                     = "index.html" -> (known after apply)
-       metadata               = {} -> null
+       server_side_encryption = (known after apply)
!       storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
+       version_id             = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_bucket_policy.website_bucket_policy must be replaced
-/+ resource "aws_s3_bucket_policy" "website_bucket_policy" {
!       bucket = "hello-env0-wzodxfuhsxrdfamz" -> (known after apply) # forces replacement
!       id     = "hello-env0-wzodxfuhsxrdfamz" -> (known after apply)
!       policy = jsonencode(
!           {
!               Statement = [
!                   {
!                       Resource  = "arn:aws:s3:::hello-env0-wzodxfuhsxrdfamz/*" -> [
+                           "arn:aws:s3:::hello-env0-wzodxfuhsxrdfamz-sagi/*",
                        ]
                        # (4 unchanged elements hidden)
                    },
                ]
                # (2 unchanged elements hidden)
            }
        )
    }

Plan: 3 to add, 0 to change, 3 to destroy.

```
</details>


```
Monthly cost change for sagilaufer1992/templates/.env0workdir/.tf-plan
Amount:  $0.00 ($0.00 -> $0.00)

```
<details>
<summary>Cost Estimation Details</summary>

```diff
Project: sagilaufer1992/templates/.env0workdir/.tf-plan

Monthly cost change for sagilaufer1992/templates/.env0workdir/.tf-plan
Amount:  $0.00 ($0.00 -> $0.00)

----------------------------------
Key: ~ changed, + added, - removed

No changes detected. Run infracost breakdown to see the full breakdown.
```
</details>


[Full PR Plan logs on env0](http://pr8900.dev.env0.com/p/b91f3296-d249-4938-96a6-72e3d8fe5b3a/environments/7d2d8690-24f0-4a42-af14-d201c687d9d1/deployments/1a2accc8-266a-4018-a93f-624d2a3cb0e7)